; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l10_p10_c10_g10)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 medicina)
	(at-box box6 deposito)
	(box-has box6 medicina)
	(at-box box7 deposito)
	(box-has box7 medicina)
	(at-box box8 deposito)
	(box-has box8 medicina)
	(at-box box9 deposito)
	(box-has box9 medicina)
	(at-box box10 deposito)
	(box-has box10 medicina)
	(at-person person1 refugio7)
	(at-person person2 refugio6)
	(at-person person3 refugio4)
	(at-person person4 refugio6)
	(at-person person5 refugio10)
	(at-person person6 refugio2)
	(at-person person7 refugio3)
	(at-person person8 refugio4)
	(at-person person9 refugio5)
	(at-person person10 refugio5)
)

(:goal (and
	(person-has person1 comida)
	(person-has person3 medicina)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person6 medicina)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person9 medicina)
	(person-has person10 medicina)
))
)

; plan
1. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 0 of 10
2. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 0 of 10
3. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 0 of 10
4. (leave box4 refugio7 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio7) (free dron1-der) (person-has person1 comida)
   goals met: 1 of 10
5. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 1 of 10
6. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 1 of 10
7. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 1 of 10
8. (move refugio6 refugio10 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio10)
   goals met: 1 of 10
9. (leave box3 refugio10 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio10) (free dron1-der) (person-has person5 comida)
   goals met: 2 of 10
10. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 2 of 10
11. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 2 of 10
12. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 2 of 10
13. (move refugio6 refugio2 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio2)
   goals met: 2 of 10
14. (leave box10 refugio2 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 medicina)
   added: (at-box box10 refugio2) (free dron1-izq) (person-has person6 medicina)
   goals met: 3 of 10
15. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 3 of 10
16. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 3 of 10
17. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 3 of 10
18. (leave box2 refugio6 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio6) (free dron1-der) (person-has person4 comida)
   goals met: 4 of 10
19. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 4 of 10
20. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 4 of 10
21. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 4 of 10
22. (move refugio6 refugio5 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio5)
   goals met: 4 of 10
23. (leave box1 refugio5 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio5) (free dron1-der) (person-has person9 comida)
   goals met: 5 of 10
24. (move refugio5 refugio6 dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 refugio6)
   goals met: 5 of 10
25. (leave box9 refugio6 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 medicina)
   added: (at-box box9 refugio6) (free dron1-izq) (person-has person4 medicina)
   goals met: 6 of 10
26. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 6 of 10
27. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 6 of 10
28. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 6 of 10
29. (leave box8 refugio4 dron1-der dron1 person3 medicina)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 medicina)
   added: (at-box box8 refugio4) (free dron1-der) (person-has person3 medicina)
   goals met: 7 of 10
30. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 7 of 10
31. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 7 of 10
32. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 7 of 10
33. (leave box7 refugio4 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 medicina)
   added: (at-box box7 refugio4) (free dron1-der) (person-has person8 medicina)
   goals met: 8 of 10
34. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 8 of 10
35. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 8 of 10
36. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 8 of 10
37. (leave box6 refugio5 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 medicina)
   added: (at-box box6 refugio5) (free dron1-der) (person-has person9 medicina)
   goals met: 9 of 10
38. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 9 of 10
39. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 9 of 10
40. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 9 of 10
41. (leave box5 refugio5 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 medicina)
   added: (at-box box5 refugio5) (free dron1-der) (person-has person10 medicina)
   goals met: 10 of 10
